#2020-06-22
#思考2：知识点一点之间的连接
# 1. 你所了解的每一个知识技术都是一个个结点，了解其原理（本质的思想 --> 先天先验知识）
#      就能扩展到很远很远的地方，与无数的点相连在一起  
# 2. 我不认同知识的边界效应, 边界效应是因为没有窥探到本质的东西(没有好奇心), 没有把这个东西的本质变为自己
#      知识空间中的一个点, 这样学了了解了就和没有了解没有什么区别, 就无法在点与点之间形成关联.
# 3. 或许这里面有一定的先天、先验因素在其中, 并不是每个人都能这样在不同的信息之间形成关联
#    或许并不是每个人都想认真的去学一些东西？
#        问题：自然科学是如此, 语言算是超验的知识吗? 为什么你语文学的不好,交流也很奇葩
#              超验是脱离于经验, 在经验之上的东西, 我们对其一无所知：
#                  上帝
#              语言是一个有规则的东西吗？
#              单词作为语言基本的组成是个有规律的东西吗？
#              语言有其规则不是超验的东西.
#    是你不喜欢学英语吗？如何用康德哲学加以解释



