# -*- coding: utf-8 -*-
"""
Created on Thu Jun 11 14:01:05 2020

@author: 爬上阁楼的鱼
"""

import numpy as np
 
a = np.arange(10)
s = slice(2,7,1)   # 从索引 2 开始到索引 7 停止，间隔为1
b = a[s]
#print (b)

# [ ] 其实就是索引获取 
b = a[2:7:1]   # 从索引 2 开始到索引 7 停止，间隔为 1
print(b)

# 冒号 : 的解释：
# 如果只放置一个参数,如 [2],将返回与该索引相对应的单个元素
# 如果为 [2:],表示从该索引开始以后的所有项都将被提取
# 如果使用了两个参数,如 [2:7],那么则提取两个索引(不包括停止索引)之间的项。
b = a[2:]
print(b)

# 索引 2 ~ 5 不包含 5
a = np.arange(40)
b = a[2:5]
print(b)

# 截取前 20 个
b = a[:20]
print(b)

# 矩阵的索引切割
# 从下一行切
a = np.array([[1,2,3],[3,4,5],[4,5,6]])
print(a)
# 从某个索引处开始切割
print('从数组索引 a[1:] 处开始切割')
print(a[1:])


# a =
# [[1 2 3]
#  [3 4 5]
#  [4 5 6]]
a = np.array([[1,2,3],[3,4,5],[4,5,6]])  

# [2 4 5]
b = a[...,1]  # 第2列元素

# [1 2 3]
b = a[0,...]  # 第1行元素

# [[2 3]
#  [4 5]
#  [5 6]]
b = a[...,1:] # 第2列及其剩下的元素
#print (b)


x = np.array([[1,  2],  [3,  4],  [5,  6]]) 
# 指定元素切割
# (0,1)
# (1,1)
# (2,0)
y = x[[0,1,2],  [0,1,0]]  
print (x)

# x = 
# [[ 0  1  2]
#  [ 3  4  5]
#  [ 6  7  8]
#  [ 9 10 11]]
x = np.array([[  0,  1,  2],[  3,  4,  5],[  6,  7,  8],[  9,  10,  11]])  
# 指定位置切割
rows = np.array([[0,0],[3,3]]) 
cols = np.array([[0,2],[0,2]]) 
# 按 (x,y) 拼起来 
# (0,0) (0,2)
# (3,0) (3,2)

# [[ 0  2]
#  [ 9 11]]
y = x[rows,cols]
print(y)

# a = 
# [[1 2 3]
#  [4 5 6]
#  [7 8 9]]
a = np.array([[1,2,3], [4,5,6],[7,8,9]])

# [[5 6]
#  [8 9]]
b = a[1:3, 1:3]
c = a[1:3,[1,2]]
d = a[...,1:]
print(b)
print(c)
print(d)







